   var Reg = {};
    /*====================================*/
    /*校验数字的js正则表达式*/
    /* ===================================*/
    //整数
    Reg.number =  /^[0-9]*$/;
    //零和非零开头的数字
    Reg.numStat0 = /^(0|[1-9][0-9]*)$/;
    //带1-2位小数的正数或负数：
    Reg.decimals =  /^(\-)?\d+(\.\d{1,2})?$/;
    //非零开头的最多带两位小数的数字：
    Reg.decimalsNot0 = /^([1-9][0-9]*)+(.[0-9]{1,2})?$/;
    //正整数
    Reg.positiveInteger = /^[0-9]*[1-9][0-9]*$/;
    //负整数
    Reg.negativeInteger = /^-[0-9]*[1-9][0-9]*$/;
    //正浮点数
    Reg.positiveReal = /^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$/;
    //负浮点数
    Reg.negativeReal = /^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/;
    //浮点数
    Reg.float =  /^(-?\d+)(\.\d+)?$/;
    //少1位的数字：
    Reg.least1 = /^\d{1,}$/;
    //少2位的数字：
    Reg.least2 =  /^\d{2,}$/;
    //少3位的数字：
    Reg.least13 =  /^\d{3,}$/;
    //少4位的数字：
    Reg.least4 = /^\d{4,}$/;

    /*====================================*/
    /*校验字符的js正则表达式*/
    /* ===================================*/

    //汉字：^[\u4e00-\u9fa5]{0,}$
    Reg.chinese = /[\u4e00-\u9fa5]/;
    //非汉字
    Reg.notChinese = /^[^\u4e00-\u9fa5]+$/;
    //英文和数字
    Reg.english_number = /^[A-Za-z0-9]+$/;
    //长度为3-20的所有字符：^.{3,20}$
    Reg.string3_20 = /^.{3,20}$/;
    //由26个英文字母组成的字符串
    Reg.string26 = /^[A-Za-z]+$/;
    //由26个大写英文字母组成的字符串
    Reg.stringUpperCase26 = /^[A-Z]+$/;
    //由26个小写英文字母组成的字符串
    Reg.stringLowerCase26 = /^[a-z]+$/;
    //由数字和26个英文字母组成的字符串
    Reg.english_string26 = /^[A-Za-z0-9]+$/;
    //中文、英文、数字包括下划线：
    Reg.cn_en_number = /^[\u4E00-\u9FA5A-Za-z0-9_]+$/;
    //英文、数字包括下划线、特殊字符：
    Reg.en_number = /^[A-Za-z0-9_~^%&',.;=?$\x22]+$/;
    //中文、英文、数字但不包括下划线等符号
    Reg.cn_en_numberNotLine = /^[\u4E00-\u9FA5A-Za-z0-9]+$ 或 ^[\u4E00-\u9FA5A-Za-z0-9]{2,20}$/;
    //可以输入含有^%&',;=?$\"等字符：[^%&',;=?$\x22]+
    Reg.specialStr = /[~^%&',;=?$\x22]+/;

    /*====================================*/
    /*特殊需求js正则表达式*/
    /* ===================================*/


    //Email邮箱地址
    Reg.email = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;
    //url域名
    Reg.url= /[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\/.?/;
    //InternetURL
    //"url2": /(http|ftp|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-\.,@?^=%&:/~\+#]*[\w\-\@?^=%&/~\+#])?/,
    //手机号码
    Reg.phone = /^1[3|4|5|7|8]\d{9}$/;
    //电话号码("XXX-XXXXXXX"、"XXXX-XXXXXXXX"、"XXX-XXXXXXX"、"XXX-XXXXXXXX"、"XXXXXXX"和"XXXXXXXX)：
    //"tel": /(\d{3}-|\d{4}-)?(\d{8}|\d{7})?/,
    Reg.tel = /^0\d{2,3}-?\d{7,8}$/;
    //身份证号：
    //15或18位身份证
    Reg.id15_18 = /^\d{15}|\d{18}$/;
    //15位身份证
    Reg.id15 = /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/;
    //18位身份证：
    Reg.id18 = /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/;
    //短身份证号码(数字、字母x结尾)
    Reg.idIndexOfX = /^\d{8,18}|[0-9x]{8,18}|[0-9X]{8,18}?$/;
    //帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)
    Reg.account = /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/;
    //密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)
    Reg.password6_18 = /^[a-zA-Z]\w{5,17}$/;
    //强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间)
    Reg.password8_10 = /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$/;
    //日期格式：
    Reg.date = /^\d{4}-\d{1,2}-\d{1,2}/;
    //一年的12个月(01～09和1～12)
    Reg.month = /^(0?[1-9]|1[0-2])$/;
    //一个月的31天(01～09和1～31)
    Reg.day31 = /^((0?[1-9])|((1|2)[0-9])|30|31)$/;
    //钱的输入格式：
    //有四种钱的表示形式我们可以接受:"10000.00" 和 "10,000.00", 和没有 "分" 的 "10000" 和 "10,000"
    Reg.money = /^[1-9][0-9]*$/;
    //任意一个不以0开头的数字,但是,这也意味着一个字符"0"不通过
    Reg.money1 = /^[1-9][0-9]*$/;
    //一个0或者一个不以0开头的数字
    Reg.money2 = /^(0|-?[1-9][0-9]*)$/;
    //0或者一个可能为负的开头不为0的数字.让用户以0开头好了.把负号的也去掉,因为钱总不能是负的吧.下面我们要加的是说明可能的小数部分
    Reg.money3 = /^[0-9]+(.[0-9]+)?$/;
    //小数点后面至少应该有1位数
    Reg.money4 = /^[0-9]+(.[0-9]{2})?$/;
    //规定小数点后面必须有两位
    Reg.money5 = /^[0-9]+(.[0-9]{1,2})?$/;
    //xml文件
    Reg.xml = /^([a-zA-Z]+-?)+[a-zA-Z0-9]+\\.[x|X][m|M][l|L]$/;
    //首尾空白字符的正则表达式：
    Reg.trim = /^\s*|\s*$/;
    //腾讯QQ号：(腾讯QQ号从10000开始)
    Reg.qq = /[1-9][0-9]{4,}/;
    //中国邮政编码：
    Reg.mail = /[1-9]\d{5}(?!\d)/;
    // IP地址：
    //'ip': /\d+\.\d+\.\d+\.\d+/,
    Reg.ip = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/;
    /*4位数字端口校验*/
    Reg.port = /^[0-9]{4}$/;
    // 不能为空：
    Reg.notEmpty = /\S/;
    //VLAN 检验三种模式1、"1-3"; 2、"1,2,3"; 3、"1-2,4"
    Reg.vlan = /^\d+([,-]\d+)*$/;
    module.exports = Reg;
